complexH([[5,3,10],[5,-8,9],[-8,-9,8],[-9,9,7],
                [2,8,6],[-7,3,5],[-1,-1,4],[1,1,3],
                [7,-3,2],[9,2,1]]).

?- printList([[1,1],[2,2],[3,3],[4,4],[5,5]]).
[1,1]
[2,2]
[3,3]
[4,4]
[5,5]
true.

?- complexH(List), printList(List).
[5,3,10]
[5,-8,9]
[-8,-9,8]
[-9,9,7]
[2,8,6]
[-7,3,5]
[-1,-1,4]
[1,1,3]
[7,-3,2]
[9,2,1]
List = [[5, 3, 10], [5, -8, 9], [-8, -9, 8], [-9, 9, 7], [2, 8, 6], [-7, 3, 5], [-1, -1|...], [1|...], [...|...]|...].


?- theClass([1],Class1).
Class1 = 1 .

?- theClass([1,2,3,4,-5,6],Class2).
Class2 = 1 .

?- distanceR2([1],[2],Dist1).
Dist1 = 0.0 .

?- distanceR2([1,1],[3,2],Dist2).
Dist2 = 4.0 .

?- complexH(List),distanceAllVectors2([1,1,1],List, AllDist1).
List = [[5, 3, 10], [5, -8, 9], [-8, -9, 8], [-9, 9, 7], [2, 8, 6], [-7, 3, 5], [-1, -1|...], [1|...], [...|...]|...],
AllDist1 = [20.0, 97.0, 181.0, 164.0, 50.0, 68.0, 8.0, 0.0, 52.0, 65.0] . 


?- complexH(List),distanceAllVectors2([99,99,10],List,AllDist2).
List = [[5, 3, 10], [5, -8, 9], [-8, -9, 8], [-9, 9, 7], [2, 8, 6], [-7, 3, 5], [-1, -1|...], [1|...], [...|...]|...],
AllDist2 = [18052.0, 20285.0, 2311.0, 19764.0, 17690.0, 20452.0, 20000.0, 19208.0,
			   18868.0, 17509.0] .

?- complexH(List),nnr1([1,1,1],List,Nnr1).
List = [[5, 3, 10], [5, -8, 9], [-8, -9, 8], [-9, 9, 7], [2, 8, 6], [-7, 3, 5], [-1, -1|...], [1|...], [...|...]|...],
Nnr1 = 3 .

?- complexH(List),nnr1([99,99,10],List,Nnr2).
List = [[5, 3, 10], [5, -8, 9], [-8, -9, 8], [-9, 9, 7], [2, 8, 6], [-7, 3, 5], [-1, -1|...], [1|...], [...|...]|...],
Nnr2 = 1 .
